test/request-response-samples/addList__complex_extension_namespace_for_arrays/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="urn:platform_2013_2.webservices.netsuite.com" xmlns:platformMsgs="urn:messages_2013_2.platform.webservices.netsuite.com" xmlns:platformFaults="urn:faults_2013_2.platform.webservices.netsuite.com"><soap:Body><platformMsgs:addList xmlns:platformMsgs="urn:messages_2013_2.platform.webservices.netsuite.com" xmlns="urn:messages_2013_2.platform.webservices.netsuite.com"><platformMsgs:record xsi:type="ns1:Contact" xmlns:ns1="urn:relationships_2013_2.lists.webservices.netsuite.com"><ns1:firstName>First-1400867779067</ns1:firstName><ns1:lastName>Sullivan</ns1:lastName><ns1:phone>800-555-2819</ns1:phone><ns1:subsidiary internalId="1" xsi:type="platformCore:RecordRef" xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com"></ns1:subsidiary></platformMsgs:record><platformMsgs:record xsi:type="ns1:Contact" xmlns:ns1="urn:relationships_2013_2.lists.webservices.netsuite.com"><ns1:firstName>aLFirst-1400867779067</ns1:firstName><ns1:lastName>Sullivan</ns1:lastName><ns1:phone>800-555-2819</ns1:phone><ns1:subsidiary internalId="1" xsi:type="platformCore:RecordRef" xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com"></ns1:subsidiary></platformMsgs:record></platformMsgs:addList></soap:Body></soap:Envelope>